-module(ecm_app).

-behaviour(application).

-export([startup/0]).

-export([start/2, stop/1]).


%% ===================================================================
%% 公共函数
%% ===================================================================


% 启动应用
startup() ->
	% 启动应用程序
	application:start(ecm).


%% ===================================================================
%% 回调函数
%% ===================================================================


% 启动应用
start(_, _) ->
	% 允许配置节点通信
	net_kernel:allow([]),
	% 设置通信COOKIE
	setAppCookie(),
	% 启动基础督程
    ecm_sup:start_link().


% 关闭应用
stop(_) ->
    ok.


%% ===================================================================
%% 内部函数
%% ===================================================================


% 设置通信COOKIE
setAppCookie() ->
	% 获取应用Cookie
	{ok, AppCookie} = application:get_env(ecm, cookie),
	% 设置COOKIE
	erlang:set_cookie(node(), AppCookie),ok.