%% @author maomao
%% @doc @todo Add description to pools_sup.


-module(ecm_conn_sup).

-behaviour(supervisor).

-export([init/1]).

-export([start_link/0]).

-define(CHILD(I), {undefined, {I, start_link, []}, temporary, 5000, worker, []}).


%% ====================================================================
%% 公共函数
%% ====================================================================


% 启动督程
start_link() ->
	supervisor:start_link(?MODULE, []).


% 关闭子进程




%% ====================================================================
%% 回调函数 
%% ====================================================================


%% init/1
init([]) ->
	% 设定督程策略
    {ok,{{simple_one_for_one, 0, 1}, [?CHILD(ecm)]}}.



%% ====================================================================
%% 私有函数
%% ====================================================================

