%% @author maomao
%% @doc @todo Add description to pools_sup.


-module(ecm_pool_sup).

-behaviour(supervisor).

-export([init/1]).

-export([start_link/1]).

-define(POOL_CHILD(I, Pool), {Pool, {I, start_link, [Pool]}, temporary, 5000, worker, []}).


%% ====================================================================
%% 公共函数
%% ====================================================================


% 启动督程
start_link(NAME) ->
	supervisor:start_link({local, NAME}, ?MODULE, []).


%% ====================================================================
%% 回调函数 
%% ====================================================================


%% init/1
init([]) ->
	
	% 设定督程策略
	{ok,{{one_for_all,0,1}, []}}.


%% ====================================================================
%% 私有函数
%% ====================================================================



